import 'package:flutter/material.dart';

class PreAndCity extends StatelessWidget {
  static Map<String, List<String>> data = {
    "北海道": ["札幌市", "旭川市", "函館市"],
    "青森県": ["青森市", "弘前市", "八戸市"],
    "岩手県": ["盛岡市", "一関市", "北上市"],
    "宮城県": ["仙台市", "石巻市", "大崎市"],
    "秋田県": ["秋田市", "横手市", "大館市"],
    "山形県": ["山形市", "鶴岡市", "酒田市"],
    "福島県": ["福島市", "郡山市", "いわき市"],
    "茨城県": ["水戸市", "つくば市", "日立市"],
    "栃木県": ["宇都宮市", "小山市", "足利市"],
    "群馬県": ["前橋市", "高崎市", "伊勢崎市"],
    "埼玉県": ["さいたま市", "川越市", "越谷市"],
    "千葉県": ["千葉市", "船橋市", "柏市"],
    "東京都": ["千代田区", "新宿区", "渋谷区", "世田谷区"],
    "神奈川県": ["横浜市", "川崎市", "相模原市"],
    "新潟県": ["新潟市", "長岡市", "上越市"],
    "富山県": ["富山市", "高岡市", "魚津市"],
    "石川県": ["金沢市", "小松市", "加賀市"],
    "福井県": ["福井市", "敦賀市", "鯖江市"],
    "山梨県": ["甲府市", "富士吉田市", "都留市"],
    "長野県": ["長野市", "松本市", "上田市"],
    "岐阜県": ["岐阜市", "大垣市", "高山市"],
    "静岡県": ["静岡市", "浜松市", "沼津市"],
    "愛知県": ["名古屋市", "豊田市", "岡崎市"],
    "三重県": ["津市", "四日市市", "伊勢市"],
    "滋賀県": ["大津市", "草津市", "彦根市"],
    "京都府": ["京都市", "宇治市", "舞鶴市"],
    "大阪府": ["大阪市", "堺市", "東大阪市"],
    "兵庫県": ["神戸市", "姫路市", "西宮市"],
    "奈良県": ["奈良市", "橿原市", "生駒市"],
    "和歌山県": ["和歌山市", "田辺市", "新宮市"],
    "鳥取県": ["鳥取市", "米子市", "倉吉市"],
    "島根県": ["松江市", "出雲市", "浜田市"],
    "岡山県": ["岡山市", "倉敷市", "津山市"],
    "広島県": ["広島市", "福山市", "呉市"],
    "山口県": ["山口市", "下関市", "宇部市"],
    "徳島県": ["徳島市", "鳴門市", "阿南市"],
    "香川県": ["高松市", "丸亀市", "坂出市"],
    "愛媛県": ["松山市", "今治市", "新居浜市"],
    "高知県": ["高知市", "南国市", "宿毛市"],
    "福岡県": ["福岡市", "北九州市", "久留米市"],
    "佐賀県": ["佐賀市", "唐津市", "鳥栖市"],
    "長崎県": ["長崎市", "佐世保市", "諫早市"],
    "熊本県": ["熊本市", "八代市", "天草市"],
    "大分県": ["大分市", "別府市", "中津市"],
    "宮崎県": ["宮崎市", "都城市", "延岡市"],
    "鹿児島県": ["鹿児島市", "霧島市", "鹿屋市"],
    "沖縄県": ["那覇市", "沖縄市", "浦添市"],
  };

  @override
  Widget build(BuildContext context) {
    // TODO: implement build
    throw UnimplementedError();
  }
}
